n = int(input("Enter number of row : "))

for i in range(1, n+1):
    C = 1
    for j in range(1, i+1):
        print(C, '', sep = ' ', end = '')
        C = C*(i-j)//j
    print()

# รับจำนวนแถว n จากผู้ใช้ แล้วแสดง “พาสคาลไทรแองเกิล” (Pascal’s Triangle) n แถว

# เช่น ถ้า n = 5 จะได้

# 1  

# 1 1  

# 1 2 1  

# 1 3 3 1  

# 1 4 6 4 1

# หมายเหตุ

# พาสคาลไทรแองเกิล คือ รูปแบบสามเหลี่ยมของจำนวนที่เรียงตามหลักของคณิตศาสตร์ โดย:


# เริ่มจากเลข 1 ที่ด้านบนสุด

# ตัวเลขในแต่ละแถวจะได้จาก ผลรวมของตัวเลข 2 ตัวด้านบนของมัน (จากแถวก่อนหน้า)

# ยกเว้นขอบซ้าย-ขวาที่เป็น เลข 1 เสมอ